---
kind: type
id: T:Autodesk.Revit.DB.GroupType
source: html/5ce7e921-2a43-d7f1-8ef9-8a397dd27b75.htm
---
# Autodesk.Revit.DB.GroupType

An element representing a group of elements that may be placed many times in a project or family.

## Syntax (C#)
```csharp
public class GroupType : ElementType
```

## Remarks
Grouping elements is useful when you need to create entities that represent repeating layouts
 or are common to many building projects, such as hotel rooms, apartments, or repeating floors.